# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Aaron Wubshet\Google Drive\1 College\2 Sophomore Year\3 SPRING\6.115\Final Project PSoC Workspace\Final Project\External_LCD_Display.cydsn\External_LCD_Display.cyprj
# Date: Thu, 18 May 2017 19:19:20 GMT
#set_units -time ns
create_clock -name {ADC_Ext_CP_Clk(routed)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {SineWaveClock(routed)} -period 4000 -waveform {0 2000} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {ADC_Ext_CP_Clk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 47 93} -nominal_period 1916.6666666666665 [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {ADC_theACLK(fixed-function)} -period 1916.6666666666665 -waveform {0 958.333333333333} -nominal_period 1916.6666666666665 [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {SineWaveClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 97 193} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {SensorScan_Clock_int} -source [get_pins {ClockBlock/clk_sync}] -edges {1 4001 8001} -nominal_period 166666.66666666666 [list [get_pins {ClockBlock/dclk_glb_2}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Aaron Wubshet\Google Drive\1 College\2 Sophomore Year\3 SPRING\6.115\Final Project PSoC Workspace\Final Project\External_LCD_Display.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Aaron Wubshet\Google Drive\1 College\2 Sophomore Year\3 SPRING\6.115\Final Project PSoC Workspace\Final Project\External_LCD_Display.cydsn\External_LCD_Display.cyprj
# Date: Thu, 18 May 2017 19:19:08 GMT
